multi-service-app/user-management-api/src/test/resources/createUserRequestWithAddress.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://gridu.qa.payment.griddynamics.com/springsoap/gen">
  <soapenv:Header/>
  <soapenv:Body>
    <gen:createUserRequest>
      <gen:name>Johhny</gen:name>
      <gen:lastName>Tyson</gen:lastName>
      <gen:email>some-email2@gmail.com</gen:email>
      <gen:addresses>
        <!--1 or more repetitions:-->
        <gen:address>
          <gen:state>CA</gen:state>
          <gen:city>Milpitas</gen:city>
          <gen:zip>08844</gen:zip>
          <gen:line1>620 N. McCarthy Boulevard</gen:line1>
          <gen:line2>sunt veniam occaecat nulla</gen:line2>
        </gen:address>
      </gen:addresses>
    </gen:createUserRequest>
  </soapenv:Body>
</soapenv:Envelope>